config/cf/Catalogs/ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыПервичныхДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ТипыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Накладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОКонфиденциальности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальныйПередаточныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ВидыПервичныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьВидыПервичныхДокументовПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	Таблица = Новый ТаблицаЗначений;	
	Таблица.Колонки.Добавить("Наименование");
	Таблица.Колонки.Добавить("ТипДокумента");
	
	ТипДокумента = Перечисления.ТипыПервичныхДокументов;
	
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Акт'"), ТипДокумента.Акт);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Договор'"), ТипДокумента.Договор);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Дополнительное соглашение'"), 
		ТипДокумента.ДополнительноеСоглашение);
		
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Накладная'"), ТипДокумента.Накладная);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Соглашение о конфиденциальности'"), 
		ТипДокумента.СоглашениеОКонфиденциальности);
		
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Спецификация'"), ТипДокумента.Спецификация);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Счет'"), ТипДокумента.Счет);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'Счет - фактура'"), ТипДокумента.СчетФактура);
	ДобавитьВТаблицуЗначений(Таблица, НСтр("ru = 'УПД'"), ТипДокумента.УниверсальныйПередаточныйДокумент);
	
	// Записываем.
	Для Каждого Строки Из Таблица Цикл
		Объект = Справочники.ВидыПервичныхДокументов.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет в таблицу значений данные по заполняемым объектам.
//
// Параметры:
//   ТЗ 	- ТаблицаЗначений - таблица, куда надо добавить.
//	 Наименование - Строка - наименование элемента.
//	 ТипДокумента - ПеречислениеСсылка.ТипыПервичныхДокументов - тип элемента.
//
Процедура ДобавитьВТаблицуЗначений(Таблица, Наименование, ТипДокумента)
	
	НоваяСтрока 				= Таблица.Добавить();	
	НоваяСтрока.Наименование 	= Наименование;
	НоваяСтрока.ТипДокумента 	= ТипДокумента;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
